package newtouch.cn.downmenu.fragment;

/**
 * @创建者 Administrator
 * @创建时间 2016/4/11 10:39
 * @描述 ${TODO}
 * @更新者 $Author$
 * @更新时间 $Date$
 * @更新描述 ${TODO}
 */
public class CatalogueFragment extends BaseFragment {
    String catalogues[][] = new String[][]{
            new String[]{"全部美食", "本帮江浙菜", "川菜", "粤菜", "湘菜", "东北菜", "台湾菜", "新疆/清真", "素菜", "火锅", "自助餐", "小吃快餐", "日本", "韩国料理",
                    "东南亚菜", "西餐", "面包甜点", "其他"},
            new String[]{"全部休闲娱乐", "咖啡厅", "酒吧", "茶馆", "KTV", "电影院", "游乐游艺", "公园", "景点/郊游", "洗浴", "足浴按摩", "文化艺术",
                    "DIY手工坊", "桌球馆", "桌面游戏", "更多休闲娱乐"},
            new String[]{"全部购物", "综合商场", "服饰鞋包", "运动户外", "珠宝饰品", "化妆品", "数码家电", "亲子购物", "家居建材"
                    , "书店", "书店", "眼镜店", "特色集市", "更多购物场所", "食品茶酒", "超市/便利店", "药店"},
            new String[]{"全部休闲娱乐", "咖啡厅", "酒吧", "茶馆", "KTV", "电影院", "游乐游艺", "公园", "景点/郊游", "洗浴", "足浴按摩", "文化艺术",
                    "DIY手工坊", "桌球馆", "桌面游戏", "更多休闲娱乐"},
            new String[]{"全", "咖啡厅", "酒吧", "茶馆", "KTV", "游乐游艺", "公园", "景点/郊游", "洗浴", "足浴按摩", "文化艺术",
                    "DIY手工坊", "桌球馆", "桌面游戏", "更多休闲娱乐"},
            new String[]{"全部", "咖啡厅", "酒吧", "茶馆", "电影院", "游乐游艺", "公园", "景点/郊游", "洗浴", "足浴按摩", "文化艺术",
                    "DIY手工坊", "桌球馆", "桌面游戏", "更多休闲娱乐"},
            new String[]{"全部休", "咖啡厅", "酒吧", "茶馆", "KTV", "电影院", "游乐游艺", "公园", "景点/郊游", "洗浴", "足浴按摩", "文化艺术",
                    "DIY手工坊", "桌球馆", "桌面游戏", "更多休闲娱乐"},
            new String[]{"全部休闲", "咖啡厅", "酒吧", "茶馆", "KTV", "电影院", "游乐游艺", "公园", "景点/郊游", "洗浴", "足浴按摩", "文化艺术",
                    "DIY手工坊", "桌球馆", "桌面游戏", "更多休闲娱乐"},
            new String[]{"全部休闲娱", "咖啡厅", "酒吧", "茶馆", "KTV", "电影院", "游乐游艺", "公园", "景点/郊游", "洗浴", "足浴按摩", "文化艺术",
                    "DIY手工坊", "桌球馆", "桌面游戏"},
            new String[]{"全部休闲娱乐", "咖啡厅", "酒吧", "茶馆", "KTV", "电影院", "游乐游艺", "公园", "景点/郊游", "洗浴", "足浴按摩", "文化艺术",
                    "DIY手工坊", "桌球馆", "桌面游戏", "更多休闲娱乐"},
            new String[]{"全部休闲aaa", "咖啡厅", "酒吧", "茶馆", "KTV", "电影院", "游乐游艺", "公园", "景点/郊游", "洗浴", "足浴按摩", "文化艺术",
                    "DIY手工坊", "桌球馆", "桌面游戏"},
    };
    String catalogues1[] = new String[]{"全部频道", "美食", "休闲娱乐", "购物", "酒店", "丽人", "运动健身", "结婚", "亲子", "爱车", "生活服务"};
    @Override
    protected String[][] setCatalogues2() {
        return catalogues;
    }

    @Override
    protected String[] setCatalogues1() {
        return catalogues1;
    }

}
